000100191030     A          R RECPUB
000101191030     A            PUBID          5A
000102191030     A            PUBNAME       30A
000103191030     A            PUBLOC        15A
