000001220212     A          R HEADER
000006220212     A                                     2DATE(*YY)
000007220212     A                                      EDTWRD('  /  /    ')
000008220215     A                                      SPACEB(1)
000011220212     A                                    52'Wibaux University'
000014220212     A                                   120'Page:'
000015220212     A                                   126PAGNBR
000016220212     A                                     2'Instructor ID:'
000017220212     A                                      SPACEB(1)
000018220212     A            INSTID         9  0     18EDTWRD('   -  -    ')
000019220212     A                                    42'Instructor Payroll Historical Wage-
000020220212     A                                       Report'
000021220215     A                                   120'Total'
000022220215     A                                     2'Average'
000023220215     A                                      SPACEB(1)
000024220215     A                                    12'Jan'
000025220215     A                                    21'Feb'
000026220215     A                                    31'Mar'
000027220215     A                                    40'Apr'
000028220215     A                                    48'May'
000029220215     A                                    57'Jun'
000030220215     A                                    66'Jul'
000031220215     A                                    75'Aug'
000032220215     A                                    84'Sep'
000033220215     A                                    93'Oct'
000034220215     A                                   102'Nov'
000035220215     A                                   111'Dec'
000036220215     A                                   120'Wages:'
000037220215     A                                     2'Wage:'
000038220215     A                                      SPACEB(1)
000039220216     A            AVGWGE1        7  2      9EDTCDE(3)
000040220215     A            AVGWGE2        7  2     19EDTCDE(3)
000041220215     A            AVGWGE3        7  2     28EDTCDE(3)
000042220215     A            AVGWGE4        7  2     37EDTCDE(3)
000043220215     A            AVGWGE5        7  2     46EDTCDE(3)
000044220215     A            AVGWGE6        7  2     55EDTCDE(3)
000045220215     A            AVGWGE7        7  2     64EDTCDE(3)
000046220215     A            AVGWGE8        7  2     73EDTCDE(3)
000047220215     A            AVGWGE9        7  2     82EDTCDE(3)
000048220215     A            AVGWGE10       7  2     91EDTCDE(3)
000049220215     A            AVGWGE11       7  2    100EDTCDE(3)
000050220215     A            AVGWGE12       7  2    109EDTCDE(3)
000074220215     A            TTLAVGWGE      9  2    118EDTCDE(3 $)
000076220215     A                                     2'Payroll'
000077220215     A                                      SPACEB(1)
000078220215     A                                     2'Year:'
000079220215     A                                      SPACEB(1)
000080220212     A                                    10'-------'
000081220212     A                                    19'-------'
000082220212     A                                    28'-------'
000083220212     A                                    37'-------'
000084220212     A                                    46'-------'
000085220212     A                                    55'-------'
000086220212     A                                    64'-------'
000087220212     A                                    73'-------'
000088220212     A                                    82'-------'
000089220212     A                                    91'-------'
000090220212     A                                   100'-------'
000091220212     A                                   109'-------'
000092220212     A                                   119'---------'
000093220215     A          R DETAIL                    SPACEB(1)
000094220215     A            YRFLD          4  0      2
000095220215     A            MTHWGE1        7  2      9EDTCDE(3)
000096220215     A            MTHWGE2        7  2     18EDTCDE(3)
000097220215     A            MTHWGE3        7  2     27EDTCDE(3)
000098220215     A            MTHWGE4        7  2     36EDTCDE(3)
000099220215     A            MTHWGE5        7  2     45EDTCDE(3)
000100220215     A            MTHWGE6        7  2     54EDTCDE(3)
000101220215     A            MTHWGE7        7  2     63EDTCDE(3)
000102220215     A            MTHWGE8        7  2     72EDTCDE(3)
000103220215     A            MTHWGE9        7  2     81EDTCDE(3)
000104220215     A            MTHWGE10       7  2     90EDTCDE(3)
000105220215     A            MTHWGE11       7  2     99EDTCDE(3)
000106220215     A            MTHWGE12       7  2    108EDTCDE(3)
000107220215     A            TTLWGE         8  2    118EDTCDE(3 $)
000108
000109220215     A*%%RS+<record-sequences>
000110220215     A*%%RS+ <sequence name="Untitled">
000111220215     A*%%RS+  <device type="printer" width="132" height="66" />
000112220215     A*%%RS+  <record-write record-format="HEADER" />
000113220215     A*%%RS+  <record-write record-format="DETAIL" />
000114220215     A*%%RS+ </sequence>
000115220215     A*%%RS </record-sequences>
