000100191030     A                                      REF(PUBLISHER)
000101191030     A          R RECBOOKS
000102191030     A            TITLE         40A
000103191030     A            AUTHOR        25A
000104191030     A            PAGES          4P
000105191120     A            PUBID     R
