000100191015     A                                      REF(SUPREF)
000101191015     A          R RECSUP
000102191015     A            SUPNAME   R
000103191015     A            SUPCTY    R
000104191015     A            SUPZP     R
